; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (position ?P) ; P is a valid coordinate position (assuming square grid)
        (inc ?P ?PP) ; PP is greater coordinate than P
        (safe-zone ?X ?Y) ; The safe zone is at coordinates (X, Y)
        (obstacle ?X ?Y) ; There is an obstacle at coordinates (X, Y)
        (person-location ?X ?Y) ; There is a person at coordinates (X, Y)
        (drone-location ?X ?Y) ; The drone is at coordinates (X, Y)
        (empty-drone) ; The drone is not carrying a person
        (spot ?S) ; S is a valid spot of the safe zone
        (free-spot ?S) ; The spot S of the safe zone is free
    )

    (:action up
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?NY ?Y)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action down
        :parameters (?X ?Y ?NY)

        :precondition (and
            (position ?X) (position ?Y) (position ?NY)
            (inc ?Y ?NY)
            (drone-location ?X ?Y)
            (not (obstacle ?X ?NY))
        )

        :effect (and
            (drone-location ?X ?NY)
            (not (drone-location ?X ?Y))
        )
    )

    (:action right
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?X ?NX)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action left
        :parameters (?X ?Y ?NX)

        :precondition (and
            (position ?X) (position ?Y) (position ?NX)
            (inc ?NX ?X)
            (drone-location ?X ?Y)
            (not (obstacle ?NX ?Y))
        )

        :effect (and
            (drone-location ?NX ?Y)
            (not (drone-location ?X ?Y))
        )
    )

    (:action pick-up
        :parameters (?X ?Y)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (person-location ?X ?Y)
            (empty-drone)
        )

        :effect (and
            (not (person-location ?X ?Y))
            (not (empty-drone))
        )
    )

    (:action drop-off
        :parameters (?X ?Y ?S)

        :precondition (and
            (position ?X) (position ?Y)
            (drone-location ?X ?Y)
            (not (empty-drone))
            (safe-zone ?X ?Y)
            (spot ?S) (free-spot ?S)
        )

        :effect (and
            (empty-drone)
            (person-location ?X ?Y)
            (not (free-spot ?S))
        )
    )

    (:action evacuate-safe-zone
        :parameters (?S)

        :precondition (and
            (spot ?S)
            (not (free-spot ?S))
        )

        :effect (free-spot ?S)
    )

)

; problem
(define (problem pb5)

    (:domain rescue-drone)

    (:objects
        P1 P2 P3 P4 P5 S1 S2 S3 S4
    )

    (:init
        (position P1)
        (position P2)
        (position P3)
        (position P4)
        (position P5)

        (inc P1 P2)
        (inc P2 P3)
        (inc P3 P4)
        (inc P4 P5)

        (safe-zone P5 P5)

        (spot S1)
        (spot S2)
        (spot S3)
        (spot S4)

        (free-spot S1)
        (free-spot S2)
        (free-spot S3)
        (free-spot S4)

        (person-location P3 P1)
        (person-location P2 P2)
        (person-location P2 P3)
        (person-location P1 P4)
        (person-location P5 P4)
        (person-location P4 P5)

        (obstacle P2 P1)
        (obstacle P5 P1)
        (obstacle P4 P2)
        (obstacle P3 P3)
        (obstacle P1 P5)

        (drone-location P1 P3)
        (empty-drone)
    )

    (:goal
        (and
            (not (person-location P3 P1))
            (not (person-location P2 P2))
            (not (person-location P2 P3))
            (not (person-location P1 P4))
            (not (person-location P5 P4))
            (not (person-location P4 P5))
            (person-location P5 P5)
            (empty-drone))
    )
)

; plan
1. (down p1 p3 p4)
   deleted: (drone-location p1 p3)
   added: (drone-location p1 p4)
   goals met: 1 of 8
2. (pick-up p1 p4)
   deleted: (person-location p1 p4) (empty-drone)
   goals met: 1 of 8
3. (right p1 p4 p2)
   deleted: (drone-location p1 p4)
   added: (drone-location p2 p4)
   goals met: 1 of 8
4. (down p2 p4 p5)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p5)
   goals met: 1 of 8
5. (right p2 p5 p3)
   deleted: (drone-location p2 p5)
   added: (drone-location p3 p5)
   goals met: 1 of 8
6. (right p3 p5 p4)
   deleted: (drone-location p3 p5)
   added: (drone-location p4 p5)
   goals met: 1 of 8
7. (right p4 p5 p5)
   deleted: (drone-location p4 p5)
   added: (drone-location p5 p5)
   goals met: 1 of 8
8. (drop-off p5 p5 s1)
   deleted: (free-spot s1)
   added: (empty-drone) (person-location p5 p5)
   goals met: 3 of 8
9. (evacuate-safe-zone s1)
   added: (free-spot s1)
   goals met: 3 of 8
10. (left p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p4 p5)
   goals met: 3 of 8
11. (left p4 p5 p3)
   deleted: (drone-location p4 p5)
   added: (drone-location p3 p5)
   goals met: 3 of 8
12. (left p3 p5 p2)
   deleted: (drone-location p3 p5)
   added: (drone-location p2 p5)
   goals met: 3 of 8
13. (up p2 p5 p4)
   deleted: (drone-location p2 p5)
   added: (drone-location p2 p4)
   goals met: 3 of 8
14. (up p2 p4 p3)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p3)
   goals met: 3 of 8
15. (pick-up p2 p3)
   deleted: (person-location p2 p3) (empty-drone)
   goals met: 3 of 8
16. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 3 of 8
17. (down p2 p4 p5)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p5)
   goals met: 3 of 8
18. (right p2 p5 p3)
   deleted: (drone-location p2 p5)
   added: (drone-location p3 p5)
   goals met: 3 of 8
19. (right p3 p5 p4)
   deleted: (drone-location p3 p5)
   added: (drone-location p4 p5)
   goals met: 3 of 8
20. (right p4 p5 p5)
   deleted: (drone-location p4 p5)
   added: (drone-location p5 p5)
   goals met: 3 of 8
21. (drop-off p5 p5 s1)
   deleted: (free-spot s1)
   added: (empty-drone)
   goals met: 4 of 8
22. (evacuate-safe-zone s1)
   added: (free-spot s1)
   goals met: 4 of 8
23. (left p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p4 p5)
   goals met: 4 of 8
24. (left p4 p5 p3)
   deleted: (drone-location p4 p5)
   added: (drone-location p3 p5)
   goals met: 4 of 8
25. (left p3 p5 p2)
   deleted: (drone-location p3 p5)
   added: (drone-location p2 p5)
   goals met: 4 of 8
26. (up p2 p5 p4)
   deleted: (drone-location p2 p5)
   added: (drone-location p2 p4)
   goals met: 4 of 8
27. (up p2 p4 p3)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p3)
   goals met: 4 of 8
28. (up p2 p3 p2)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p2)
   goals met: 4 of 8
29. (pick-up p2 p2)
   deleted: (person-location p2 p2) (empty-drone)
   goals met: 4 of 8
30. (down p2 p2 p3)
   deleted: (drone-location p2 p2)
   added: (drone-location p2 p3)
   goals met: 4 of 8
31. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 4 of 8
32. (down p2 p4 p5)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p5)
   goals met: 4 of 8
33. (right p2 p5 p3)
   deleted: (drone-location p2 p5)
   added: (drone-location p3 p5)
   goals met: 4 of 8
34. (right p3 p5 p4)
   deleted: (drone-location p3 p5)
   added: (drone-location p4 p5)
   goals met: 4 of 8
35. (right p4 p5 p5)
   deleted: (drone-location p4 p5)
   added: (drone-location p5 p5)
   goals met: 4 of 8
36. (drop-off p5 p5 s1)
   deleted: (free-spot s1)
   added: (empty-drone)
   goals met: 5 of 8
37. (left p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p4 p5)
   goals met: 5 of 8
38. (pick-up p4 p5)
   deleted: (person-location p4 p5) (empty-drone)
   goals met: 5 of 8
39. (right p4 p5 p5)
   deleted: (drone-location p4 p5)
   added: (drone-location p5 p5)
   goals met: 5 of 8
40. (drop-off p5 p5 s2)
   deleted: (free-spot s2)
   added: (empty-drone)
   goals met: 6 of 8
41. (up p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p5 p4)
   goals met: 6 of 8
42. (pick-up p5 p4)
   deleted: (person-location p5 p4) (empty-drone)
   goals met: 6 of 8
43. (down p5 p4 p5)
   deleted: (drone-location p5 p4)
   added: (drone-location p5 p5)
   goals met: 6 of 8
44. (drop-off p5 p5 s3)
   deleted: (free-spot s3)
   added: (empty-drone)
   goals met: 7 of 8
45. (left p5 p5 p4)
   deleted: (drone-location p5 p5)
   added: (drone-location p4 p5)
   goals met: 7 of 8
46. (left p4 p5 p3)
   deleted: (drone-location p4 p5)
   added: (drone-location p3 p5)
   goals met: 7 of 8
47. (left p3 p5 p2)
   deleted: (drone-location p3 p5)
   added: (drone-location p2 p5)
   goals met: 7 of 8
48. (up p2 p5 p4)
   deleted: (drone-location p2 p5)
   added: (drone-location p2 p4)
   goals met: 7 of 8
49. (up p2 p4 p3)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p3)
   goals met: 7 of 8
50. (up p2 p3 p2)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p2)
   goals met: 7 of 8
51. (right p2 p2 p3)
   deleted: (drone-location p2 p2)
   added: (drone-location p3 p2)
   goals met: 7 of 8
52. (up p3 p2 p1)
   deleted: (drone-location p3 p2)
   added: (drone-location p3 p1)
   goals met: 7 of 8
53. (pick-up p3 p1)
   deleted: (person-location p3 p1) (empty-drone)
   goals met: 7 of 8
54. (down p3 p1 p2)
   deleted: (drone-location p3 p1)
   added: (drone-location p3 p2)
   goals met: 7 of 8
55. (left p3 p2 p2)
   deleted: (drone-location p3 p2)
   added: (drone-location p2 p2)
   goals met: 7 of 8
56. (down p2 p2 p3)
   deleted: (drone-location p2 p2)
   added: (drone-location p2 p3)
   goals met: 7 of 8
57. (down p2 p3 p4)
   deleted: (drone-location p2 p3)
   added: (drone-location p2 p4)
   goals met: 7 of 8
58. (down p2 p4 p5)
   deleted: (drone-location p2 p4)
   added: (drone-location p2 p5)
   goals met: 7 of 8
59. (right p2 p5 p3)
   deleted: (drone-location p2 p5)
   added: (drone-location p3 p5)
   goals met: 7 of 8
60. (right p3 p5 p4)
   deleted: (drone-location p3 p5)
   added: (drone-location p4 p5)
   goals met: 7 of 8
61. (right p4 p5 p5)
   deleted: (drone-location p4 p5)
   added: (drone-location p5 p5)
   goals met: 7 of 8
62. (drop-off p5 p5 s4)
   deleted: (free-spot s4)
   added: (empty-drone)
   goals met: 8 of 8
